artillery/round-robin/rr.yaml
config:
  target: 'http://shop.dev/api'
  phases:
    - duration: 1
      arrivalRate: 1

scenarios:
  - name: 'Load test with Round Robin'
    flow:
      - post:
          url: '/products'
          json:
            name: 'Test Product'
            price: 10
            description: 'Lorem ipsum'
          capture:
            selector: '$.id'
            as: 'productId'
      - get:
          url: '/products/{{productId}}'
      - put:
          url: '/products/{{productId}}'
          json:
            title: 'New Title'
            price: 20
            description: 'New description'